app/controllers/users_controller.rb

  def process_login
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'Admin' LIMIT 1